; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared4 - mode
	infrared0 - mode
	image2 - mode
	thermograph1 - mode
	image3 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Star22 - direction
	Star23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Phenomenon28 - direction
	Phenomenon29 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon20)
	(supports instrument3 image2)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image2)
	(supports instrument5 image3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon19)
	(supports instrument6 image2)
	(supports instrument6 thermograph1)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument7 thermograph1)
	(supports instrument7 image2)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
)
(:goal (and
	(pointing satellite0 Star25)
	(pointing satellite2 Star8)
	(pointing satellite3 Planet15)
	(have_image Phenomenon5 image3)
	(have_image Phenomenon7 infrared4)
	(have_image Star8 infrared4)
	(have_image Star9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 image2)
	(have_image Star12 thermograph1)
	(have_image Star13 infrared4)
	(have_image Planet14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Planet16 infrared0)
	(have_image Planet17 thermograph1)
	(have_image Star18 infrared4)
	(have_image Phenomenon19 image3)
	(have_image Phenomenon20 thermograph1)
	(have_image Planet21 image3)
	(have_image Star22 image3)
	(have_image Phenomenon24 image3)
	(have_image Star25 thermograph1)
	(have_image Planet26 infrared4)
	(have_image Phenomenon27 infrared4)
	(have_image Phenomenon28 image2)
	(have_image Phenomenon29 image2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 26
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 26
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 26
4. (turn_to satellite4 groundstation4 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 26
5. (calibrate satellite4 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 26
6. (turn_to satellite4 phenomenon11 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 26
7. (take_image satellite4 phenomenon11 instrument7 image2)
   added: (have_image phenomenon11 image2)
   goals met: 1 of 26
8. (turn_to satellite4 phenomenon19 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon19)
   goals met: 1 of 26
9. (take_image satellite4 phenomenon19 instrument7 image3)
   added: (have_image phenomenon19 image3)
   goals met: 2 of 26
10. (turn_to satellite4 phenomenon20 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 26
11. (take_image satellite4 phenomenon20 instrument7 thermograph1)
   added: (have_image phenomenon20 thermograph1)
   goals met: 3 of 26
12. (turn_to satellite4 phenomenon24 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon24)
   goals met: 3 of 26
13. (take_image satellite4 phenomenon24 instrument7 image3)
   added: (have_image phenomenon24 image3)
   goals met: 4 of 26
14. (turn_to satellite4 phenomenon28 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 phenomenon28)
   goals met: 4 of 26
15. (take_image satellite4 phenomenon28 instrument7 image2)
   added: (have_image phenomenon28 image2)
   goals met: 5 of 26
16. (turn_to satellite4 phenomenon29 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 phenomenon29)
   goals met: 5 of 26
17. (take_image satellite4 phenomenon29 instrument7 image2)
   added: (have_image phenomenon29 image2)
   goals met: 6 of 26
18. (turn_to satellite4 phenomenon5 phenomenon29)
   deleted: (pointing satellite4 phenomenon29)
   added: (pointing satellite4 phenomenon5)
   goals met: 6 of 26
19. (take_image satellite4 phenomenon5 instrument7 image3)
   added: (have_image phenomenon5 image3)
   goals met: 7 of 26
20. (turn_to satellite4 planet14 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet14)
   goals met: 7 of 26
21. (take_image satellite4 planet14 instrument7 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 8 of 26
22. (turn_to satellite4 planet15 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet15)
   goals met: 8 of 26
23. (take_image satellite4 planet15 instrument7 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 9 of 26
24. (turn_to satellite4 planet17 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet17)
   goals met: 9 of 26
25. (take_image satellite4 planet17 instrument7 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 10 of 26
26. (turn_to satellite4 planet21 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet21)
   goals met: 10 of 26
27. (take_image satellite4 planet21 instrument7 image3)
   added: (have_image planet21 image3)
   goals met: 11 of 26
28. (turn_to satellite4 star12 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 star12)
   goals met: 11 of 26
29. (take_image satellite4 star12 instrument7 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 12 of 26
30. (turn_to satellite4 star22 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star22)
   goals met: 12 of 26
31. (take_image satellite4 star22 instrument7 image3)
   added: (have_image star22 image3)
   goals met: 13 of 26
32. (turn_to satellite4 star25 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 star25)
   goals met: 13 of 26
33. (take_image satellite4 star25 instrument7 thermograph1)
   added: (have_image star25 thermograph1)
   goals met: 14 of 26
34. (turn_to satellite3 planet15 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet15)
   goals met: 15 of 26
35. (turn_to satellite2 groundstation0 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 groundstation0)
   goals met: 15 of 26
36. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 15 of 26
37. (turn_to satellite2 planet10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet10)
   goals met: 15 of 26
38. (take_image satellite2 planet10 instrument5 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 16 of 26
39. (turn_to satellite2 planet16 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet16)
   goals met: 16 of 26
40. (take_image satellite2 planet16 instrument5 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 17 of 26
41. (turn_to satellite2 star8 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star8)
   goals met: 18 of 26
42. (turn_to satellite0 groundstation1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation1)
   goals met: 18 of 26
43. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 18 of 26
44. (turn_to satellite0 phenomenon27 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon27)
   goals met: 18 of 26
45. (take_image satellite0 phenomenon27 instrument0 infrared4)
   added: (have_image phenomenon27 infrared4)
   goals met: 19 of 26
46. (turn_to satellite0 phenomenon7 phenomenon27)
   deleted: (pointing satellite0 phenomenon27)
   added: (pointing satellite0 phenomenon7)
   goals met: 19 of 26
47. (take_image satellite0 phenomenon7 instrument0 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 20 of 26
48. (turn_to satellite0 planet26 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet26)
   goals met: 20 of 26
49. (take_image satellite0 planet26 instrument0 infrared4)
   added: (have_image planet26 infrared4)
   goals met: 21 of 26
50. (turn_to satellite0 star13 planet26)
   deleted: (pointing satellite0 planet26)
   added: (pointing satellite0 star13)
   goals met: 21 of 26
51. (take_image satellite0 star13 instrument0 infrared4)
   added: (have_image star13 infrared4)
   goals met: 22 of 26
52. (turn_to satellite0 star18 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star18)
   goals met: 22 of 26
53. (take_image satellite0 star18 instrument0 infrared4)
   added: (have_image star18 infrared4)
   goals met: 23 of 26
54. (turn_to satellite0 star25 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star25)
   goals met: 24 of 26
55. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 23 of 26
56. (take_image satellite2 star9 instrument5 infrared0)
   added: (have_image star9 infrared0)
   goals met: 24 of 26
57. (turn_to satellite2 star8 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star8)
   goals met: 25 of 26
58. (turn_to satellite0 star8 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 star8)
   goals met: 24 of 26
59. (take_image satellite0 star8 instrument0 infrared4)
   added: (have_image star8 infrared4)
   goals met: 25 of 26
60. (turn_to satellite0 star25 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star25)
   goals met: 26 of 26
